/*题目描述
请输入一个5位正整数，然后分解出它的每位数字，并将这些数字按间隔2个空格的逆序形式打印输出. 当输出的不是正整数时，输出“输入不是5位正整数。”
例如，用户输入42339，则程序输出如下结果：9  3  3  2  4
  用户输入：-32567，则输出结果如下：输入不是5位正整数。
输入
一个5位正整数：x
输出
逆序的数字，且间隔2个空格
样例输入 Copy
42339
345
样例输出 Copy
9  3  3  2  4
输入不是5位正整数。*/

#include <iostream>
using namespace std;
int main()
{
    int x;
    while (cin >> x)
    {
        if (x >= 10000 && x <= 99999) cout << x % 10 << "  " << x / 10 % 10 << "  " << x / 100 % 10 << "  " << x / 1000 % 10 << "  " << x / 10000 % 10 << endl;
        else cout << "输入不是5位正整数。" << endl;
 
    }
    system("pause");
    return 0;
}
